Author: Rodrigo Rojas
Contact: rrojas@clemson.edu
Purpose: Test SDE3

-----------------------------------------------------------------------------

First Grammar:

?- s1([a,c,a,c,a,c,a,c],[]).
true.

?- s1([a,c,a,c,a,c,a,c,c],[]).
false.

?- s1([a,c,a,c,a,c,a,c,a],[]).
false.

?- none([a,c,a,c,a,c,a,c]).
false.

?- none([a,c,a,c,a,c,a,c,c]).
true.

- none([a,c,a,c,a,c,a,c,a]).
true.

-----------------------------------------------------------------------------

Second Grammar:

?- s2([a,a,a,c,c],[]).
true.

?- s2([a,a,a,a,c,c,c],[]).
true.

?- s2([a,a,a,a,c,c,c],[]).
true.

?- s2([a,a,a,a,c,c,c,d],[]).
false.

?- s2([a,a,a,a,c,c,c,a],[]).
false.

?- none([a,a,a,c,c]).
false.

?- none([a,a,a,a,c,c,c]).
false.

?- none([a,a,a,a,c,c,c,a]).
true.

?- none([a,a,a,a,c,c,c,d]).
true.

-----------------------------------------------------------------------------

Third Grammar: 

?- s3([c,c,a,a],[]).
true.

?- s3([c,c,a,a,a,a],[]).
true.

?- none([c,c,a,a,a,a]).
false.

?- none([c,c,a,a]).
false.

?- s3([c,a,c,a],[]).
false.

?- none([c,a,c,a]).
true.

-----------------------------------------------------------------------------











